Revit 2026 API

# IExtElemChangeBeamSection Interface

---

Interface Change Beam section functionality to be implemented in add-ins

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IExtElemChangeBeamSection
```
```vb
Public Interface IExtElemChangeBeamSection
```
```cpp
public interface class IExtElemChangeBeamSection
```
```fsharp
type IExtElemChangeBeamSection = interface end
```

The IExtElemChangeBeamSection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ChangeSection | The method that will be called when user wants to change beam section |

#### Reference

Autodesk.Revit.DB.Structure Namespace